BAS BMEKZU Project/src/Documents/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом</name>
  <registerRecords>InformationRegister.ИНАГРО_ВзносыВФондыРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаРаботу</name>
    <comment>Сумма в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерОплаты</name>
    <type>
      <types>EnumRef.ИНАГРО_ХарактерВыплатыПоДоговору</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ИНАГРО_Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначитьВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзносаФОТ</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПрекращения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_ВидДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций/ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидНачисления</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыНачисленийРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ВидУчетаВремениДляСредней</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыУчетаВремениДляСредней</types>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ИНАГРО_Начисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ВзносыВФондыРаботниковОрганизаций/ИНАГРО_ВзносыВФондыРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ВзносыВФондыРаботниковОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ВзносыВФондыПоГруппам/ИНАГРО_ВзносыВФондыПоГруппам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ВзносыВФондыПоГруппам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаВзносов</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГруппыВзносовВФонды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ХарактерВыплатыПоДоговору/ИНАГРО_ХарактерВыплатыПоДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ХарактерВыплатыПоДоговору</name>
  <enumValues>
    <name>ОднократноВКонцеСрока</name>
  </enumValues>
  <enumValues>
    <name>Ежемесячно</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ВидыДействияСНачислением/ВидыДействияСНачислением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействияСНачислением</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Начать</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Изменить</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеИзменять</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прекратить</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеНазначение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоНаправлениюОргановЗанятости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ГруппаВзносов</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГруппыВзносовВФонды</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ДоговорПодряда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.УдалитьВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		// Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			ДвиженияРегистров()
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецОбласти

#Область Проведение

// Формирует запрос по шапке документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация",	Организация);
	Запрос.УстановитьПараметр("парамСсылка",	Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ВЫБОР
	|		КОГДА Договор.Сотрудник.ГоловнаяОрганизация = &парамГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ЛОЖЬ КАК ОшибкаСотрудникНеДоговорник
	|ИЗ
	|	Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом КАК Договор
	|ГДЕ
	|	Договор.Ссылка = &парамСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ТекстСообщения = НСтр("ru='Указан сотрудник другой организации!';uk='Вказаний співробітник іншої організації!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ОшибкаСотрудникНеДоговорник Тогда
		ТекстСообщения = НСтр("ru='Указан сотрудник, не являющийся договорником!';uk='Вказаний співробітник не є договірником!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
	// ДатаНачала
	Если ДатаНачала > ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru='Неверно указаны даты договора!';uk='Невірно вказані дати договору!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ДвиженияРегистров()
	
	Движения.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движение = Движения.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	Если ХарактерОплаты = Перечисления.ИНАГРО_ХарактерВыплатыПоДоговору.Ежемесячно Тогда
		Движение.Период			= ДатаНачала;
	Иначе
		Движение.Период			= Макс(НачалоМесяца(ДатаОкончания), ДатаНачала);   
	КонецЕсли;
	
	// Измерения
	Движение.Сотрудник		= Сотрудник;
	Движение.Организация	= Организация;
	Движение.ВидНачисления 	= Перечисления.ИНАГРО_ВидыНачисленийРаботникаОрганизации.ПустаяСсылка();
	Движение.ДокументОснование = Ссылка;
	
	// Ресурсы
	Движение.ВидРасчета		= ВидРасчета;
	Движение.Действует		= Истина;
	Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать;
	Движение.Показатель1	= СуммаЗаРаботу;
	Движение.СпособОтраженияВБухучете	= СпособОтраженияВБухучете;
	// Реквизиты
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Движение = Движения.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций.Добавить();
		Движение.Период 	= КонецДня(ДатаОкончания);
		
		// Измерения
		Движение.Сотрудник			= Сотрудник;
		Движение.Организация		= Организация;
		Движение.ВидНачисления 		= Перечисления.ИНАГРО_ВидыНачисленийРаботникаОрганизации.ПустаяСсылка();
		Движение.ДокументОснование 	= Ссылка;
		
		Движение.ВидРасчета	= ВидРасчета;
		Движение.Действие	= Перечисления.ВидыДействияСНачислением.Прекратить;
		Движение.Действует	= Ложь;
	КонецЕсли;	
	
	// Взносы в фонды
	Если НазначитьВзносы Тогда
		ЗапросВзносы = Новый Запрос;
		ЗапросВзносы.УстановитьПараметр("Сотрудники", ?(ЗначениеЗаполнено(Сотрудник.ОсновноеНазначение),Сотрудник.ОсновноеНазначение,Сотрудник));
		ЗапросВзносы.УстановитьПараметр("Организация",	Организация);
		ЗапросВзносы.УстановитьПараметр("Дата",			ДатаНачала);
		
		СписокВзносов = Новый СписокЗначений;
		СписокВзносов.Добавить (Справочники.Налоги.ЕСВГПХ);
		ЗапросВзносы.УстановитьПараметр("Взносы", СписокВзносов);
		
		Если ЗначениеЗаполнено(Сотрудник.ИНАГРО_ГруппаВзносов) Тогда
			ЗапросВзносы.УстановитьПараметр("Группа", Сотрудник.ИНАГРО_ГруппаВзносов);
		Иначе
			ЗапросВзносы.УстановитьПараметр("Группа", Справочники.ИНАГРО_ГруппыВзносовВФонды.Договорники);
		КонецЕсли;	
		
		ЗапросВзносы.Текст = 
		"ВЫБРАТЬ
		|	Взносы.Сотрудник,
		|	Взносы.Налог,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(Взносы.Было) = ЛОЖЬ
		|				И МАКСИМУМ(Взносы.Стало) = ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
		|		КОГДА МАКСИМУМ(Взносы.Было) = ИСТИНА
		|				И МАКСИМУМ(Взносы.Стало) = ЛОЖЬ
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять)
		|	КОНЕЦ КАК Действие,
		|	&Дата КАК ДатаДействия
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВзносыВФондыРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		ВзносыВФондыРаботниковОрганизацийСрезПоследних.Налог КАК Налог,
		|		ИСТИНА КАК Было,
		|		ЛОЖЬ КАК Стало
		|	ИЗ
		|		РегистрСведений.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.СрезПоследних(
		|				&Дата,
		|				Сотрудник В (&Сотрудники)
		|					И Налог В (&Взносы)) КАК ВзносыВФондыРаботниковОрганизацийСрезПоследних
		|	ГДЕ
		|		ВзносыВФондыРаботниковОрганизацийСрезПоследних.Действует
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	 ВЫБРАТЬ
		|		Сотрудники.Ссылка,
		|		ВзносыВФондыПоГруппам.Налог,
		|		ЛОЖЬ,
		|		ИСТИНА
		|	 ИЗ
		|	    Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИНАГРО_ВзносыВФондыПоГруппам.СрезПоследних(&Дата) КАК ВзносыВФондыПоГруппам
		|		ПО ИСТИНА
		|	 ГДЕ ВзносыВФондыПоГруппам.ГруппаВзносов = &Группа
		|		И ВзносыВФондыПоГруппам.Налог В (&Взносы)
		|		И ВзносыВФондыПоГруппам.Действует
		|		И Сотрудники.Ссылка В (&Сотрудники)
		|	 ) КАК Взносы
		|   ГДЕ НЕ Взносы.Было
		|
		|СГРУППИРОВАТЬ ПО
		|	Взносы.Сотрудник,
		|	Взносы.Налог";
		
		ВыборкаПоВзносам = ЗапросВзносы.Выполнить().Выбрать();
		Движения.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.Записывать = Истина;
		Пока ВыборкаПоВзносам.Следующий() Цикл
			Если ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				
				Движение = Движения.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.Добавить();
				
				Движение.Период       = НачалоМесяца(ВыборкаПоВзносам.ДатаДействия);
				// Измерения
				Движение.Организация  = Организация;
				Движение.Сотрудник    = ВыборкаПоВзносам.Сотрудник;
				Движение.Налог		  = ВыборкаПоВзносам.Налог;
				Движение.Действует	= Истина;
			ИначеЕсли ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				
				Движение = Движения.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.Добавить();
				
				Движение.Период       = ВыборкаПоВзносам.ДатаДействия-1;
				// Измерения
				Движение.Организация  = Организация;
				Движение.Сотрудник    = ВыборкаПоВзносам.Сотрудник;
				Движение.Налог		  = ВыборкаПоВзносам.Налог;
				Движение.Действует = Ложь;	
			ИначеЕсли ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
				ТекстСообщения = НСтр("ru='На дату начала договора сотруднику уже назначено удержание взноса ';uk='На дату початку договору працівнику вже призначене утримання внеску '") + ВыборкаПоВзносам.Налог.Наименование;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,);
			КонецЕсли;	
		КонецЦикла;	
		
		
		СписокВзносов = Новый СписокЗначений;
		Если ВидВзносаФОТ.Пустая() Тогда      
			СписокВзносов.Добавить (Справочники.Налоги.ЕСВФОТГПХ);
		Иначе
			СписокВзносов.Добавить (ВидВзносаФОТ);
		КонецЕсли;
		ЗапросВзносы.УстановитьПараметр("Взносы", СписокВзносов);
		ВыборкаПоВзносам = ЗапросВзносы.Выполнить().Выбрать();
		Пока ВыборкаПоВзносам.Следующий() Цикл
			Если ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				
				Движение = Движения.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.Добавить();
				
				Движение.Период       = НачалоМесяца(ВыборкаПоВзносам.ДатаДействия);
				// Измерения
				Движение.Организация  = Организация;
				Движение.Сотрудник    = ВыборкаПоВзносам.Сотрудник;
				Движение.Налог		  = ВыборкаПоВзносам.Налог;
				Движение.Действует	= Истина;
				
			ИначеЕсли ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				
				Движение = Движения.ИНАГРО_ВзносыВФондыРаботниковОрганизаций.Добавить();
				
				Движение.Период       = ВыборкаПоВзносам.ДатаДействия-1;
				// Измерения
				Движение.Организация  = Организация;
				Движение.Сотрудник    = ВыборкаПоВзносам.Сотрудник;
				Движение.Налог		  = ВыборкаПоВзносам.Налог;
				Движение.Действует = Ложь;	
				
			ИначеЕсли ВыборкаПоВзносам.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
				ТекстСообщения = НСтр("ru='На дату начала договора сотруднику уже назначено удержание взноса ';uk='На дату початку договору працівнику вже призначене утримання внеску '") + ВыборкаПоВзносам.Налог.Наименование;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,,,);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
